orosys/DIY-Sim-Racing-FFB-Pedal/ESP32_master/src/Main.cpp

/* Todo*/
// https://github.com/espressif/arduino-esp32/issues/7779

#define ESTIMATE_LOADCELL_VARIANCE
#define ISV_COMMUNICATION
//#define PRINT_SERVO_STATES

#define DEBUG_INFO_0_CYCLE_TIMER 1
#define DEBUG_INFO_0_STEPPER_POS 2
#define DEBUG_INFO_0_LOADCELL_READING 4
#define DEBUG_INFO_0_SERVO_READINGS 8
#define DEBUG_INFO_0_PRINT_ALL_SERVO_REGISTERS 16
#define DEBUG_INFO_0_STATE_BASIC_INFO_STRUCT 32
#define DEBUG_INFO_0_STATE_EXTENDED_INFO_STRUCT 64
#define DEBUG_INFO_0_CONTROL_LOOP_ALGO 128

#define BAUD3M 3000000
#define PI 3.14159267
#define DEG_TO_RAD PI / 180

#include "Arduino.h"
#include "Main.h"
#include "esp_system.h"
#ifndef CONFIG_IDF_TARGET_ESP32C6
  #include "soc/rtc_cntl_reg.h"
#endif
// alias to serial stream, thus it can dynamically switch depending on board
Stream *ActiveSerial = nullptr;
//Stream *ActiveSerial = nullptr;
#include "FanatecInterface.h"
#include "OTA_Pull.h"
#include "Version_Board.h"
#include <EEPROM.h>
#include <DiyActivePedal_types.h>
#include "Wire.h"
#include "SPI.h"
#include "JoystickController.h"

#include <MovingAverageFilter.h>
#include <TaskScheduler.h>


// https://www.tutorialspoint.com/cyclic-redundancy-check-crc-in-arduino
uint16_t checksumCalculator(uint8_t * data, uint16_t length)
{
   uint16_t curr_crc = 0x0000;
   uint8_t sum1 = (uint8_t) curr_crc;
   uint8_t sum2 = (uint8_t) (curr_crc >> 8);
   int index;
   for(index = 0; index < length; index = index+1)
   {
      sum1 = (sum1 + data[index]) % 255;
      sum2 = (sum2 + sum1) % 255;
   }
   return (sum2 << 8) | sum1;
}

DapConfig_t dap_config_st[3];
DapCalculationVariables_t dap_calculationVariables_st;
DapStateBasic_t dap_state_basic_st[3];
DapStateExtended_t dap_state_extended_st[3];
DapActions_t dap_actions_st[3];
DapActions_t dap_actionassignment_st[3];
DapBridgeState_t dap_bridge_state_st;
DapConfig_t dap_config_st_Clu;
DapConfig_t dap_config_st_Brk;
DapConfig_t dap_config_st_Gas;
DapConfig_t dap_config_st_Temp;
DapEspPairing_t dap_esppairing_st;//saving
DapEspPairing_t dap_esppairing_lcl;//sending
//DapConfig_t dap_config_st_store[3];
DapBridgeState_t dap_bridge_state_lcl;//
DapActionOta_t dap_action_ota_st;
#include "ESPNOW_lib.h"

// global variable for servo config routing ---
DAP_servo_config_st_t dap_servo_config_st[3];          // packets from host to servo
DAP_servo_config_st_t dap_servo_config_response_st[3]; // packets from servo to host (responses)
bool update_servo_config[3] = {false, false, false};
bool send_servo_config_to_host[3] = {false, false, false}; // Muss in ESPNOW_lib.cpp bei RX gesetzt werden
bool firstDebugMessage_b = false;
uint8_t g_currentWifiChannel_u8 = 11;


#define EEPROM_offset 15

bool isSerialConfigGet[3]={false, false, false};

#ifndef CONFIG_IDF_TARGET_ESP32S3
  #include <rtc_wdt.h>
#endif
#ifdef USING_LED
  #include "soc/soc_caps.h"
  #include <Adafruit_NeoPixel.h>
  #ifdef LED_ENABLE_WAVESHARE
    #define LEDS_COUNT 1
    Adafruit_NeoPixel pixels(LEDS_COUNT, LED_GPIO, NEO_RGB + NEO_KHZ800);
  #endif
  #ifdef LED_ENABLE_DONGLE
    #define LEDS_COUNT 3
    Adafruit_NeoPixel pixels(LEDS_COUNT, LED_GPIO, NEO_GRB + NEO_KHZ800);
  #endif
  #define CHANNEL 0
  #define LED_BRIGHT 30
  /*
  static const crgb_t L_RED = 0xff0000;
  static const crgb_t L_GREEN = 0x00ff00;
  static const crgb_t L_BLUE = 0x0000ff;
  static const crgb_t L_WHITE = 0xe0e0e0;
  static const crgb_t L_YELLOW = 0xffde21;
  static const crgb_t L_ORANGE = 0xffa500;
  static const crgb_t L_CYAN = 0x00ffff;
  static const crgb_t L_PURPLE = 0x800080;
  */

#endif

#ifdef Fanatec_comunication
  FanatecInterface fanatec(Fanatec_serial_RX, Fanatec_serial_TX, Fanatec_plug); // RX: GPIO18, TX: GPIO17, PLUG: GPIO16
  bool Fanatec_Mode=false;
#endif

#ifdef OTA_Update
  void otaUpdateTask(void *pvParameters);
#endif


#ifdef External_RP2040
  #include "RP2040PicoUART.h"
  RP2040PicoUART *_rp2040picoUART;
  DAP_JoystickUART_State dap_joystickUART_state_lcl;
#endif

#ifdef Using_MCP4728
  #include <Adafruit_MCP4728.h>
  Adafruit_MCP4728 mcp;
  TwoWire MCP4728_I2C= TwoWire(1);
  bool MCP_status =false;
#endif

//global variables
bool configUpdateAvailable[3] = {false, false, false};                              
  //DapConfig_t dap_config_st_local;
int32_t joystickNormalizedToInt32 = 0;                           
bool resetPedalPosition = false;
bool dap_action_update[3]= {false,false,false};
MovingAverageFilter rssi_filter(30);
int32_t joystickNormalizedToInt32_local = 0;

uint8_t pedal_avaliable[3]={0,0,0};
uint8_t LED_Status=0; //0=normal 1= pairing
TaskScheduler taskScheduler;
//task define here
void espNowCommunicationTxTask( void * pvParameters);
void joystickUpdateTask(void *pvParameters);
void ledUpdateTask( void * pvParameters);
void serialCommunicationRxTask( void * pvParameters);
void serialCommunicationTxTask( void * pvParameters);
void ledUpdateDongleTask( void * pvParameters);
void fanatecUpdateTask(void *pvParameters);
void miscTask(void *pvParameters);
void hidCommunicaitonRxTask(void *pvParameters);
void hidCommunicaitonTxTask(void *pvParameters);
void setup()
{
  #ifdef USB_JOYSTICK
    Serial1.begin(BAUD3M, SERIAL_8N1, 44, 43);
    // ActiveSerial->begin(BAUD3M, SERIAL_8N1, 44, 43);
    ActiveSerial = &Serial1;
    
  #else
    Serial.begin(BAUD3M, SERIAL_8N1, 44, 43);
    ActiveSerial = &Serial;
  #endif

  #ifdef External_RP2040
        _rp2040picoUART = new RP2040PicoUART(RP2040rxPin, RP2040txPin, handshakeGPIO, RP2040baudrate);
  #endif
  
  #if PCB_VERSION == 5 || PCB_VERSION == 6 || PCB_VERSION == 7 || PCB_VERSION == 8 || PCB_VERSION == 9
    // ActiveActiveSerial->setTxTimeoutMs(0);
    //ActiveSerial->setRxBufferSize(1024);
    //ActiveSerial->setTimeout(5);
    //ActiveSerial->begin(3000000);
  #else
      ActiveSerial->setRxBufferSize(1024);
    ActiveSerial->begin(921600);
    ActiveSerial->setTimeout(5);

  #endif
  
  // setup serial


   ActiveSerial->println(" ");
   ActiveSerial->println(" ");
   ActiveSerial->println(" ");

   ActiveSerial->println("[L]This work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License.");
   ActiveSerial->println("[L]Please check github repo for more detail: https://github.com/ChrGri/DIY-Sim-Racing-FFB-Pedal");
  #ifdef OTA_Update
    ActiveSerial->print("[L]Board:");
    ActiveSerial->println(BRIDGE_BOARD);
    ActiveSerial->print("[L]Version:");
    ActiveSerial->println(BRIDGE_FIRMWARE_VERSION);
  #endif
  parse_version(BRIDGE_FIRMWARE_VERSION,&versionMajor,&versionMinor,&versionPatch);
  delay(5);
  #ifdef USB_JOYSTICK
    ActiveSerial->println("[L]Setup controller");
    SetupController();
    delay(500);
    tinyusbJoystick_.printf("This work is licensed under a CC-BY-NC-SA License.\nPlease check github repo for more detail: https://github.com/ChrGri/DIY-Sim-Racing-FFB-Pedal\nBridge: Board:%s, Version:%s.", BRIDGE_BOARD, BRIDGE_FIRMWARE_VERSION);
    delay(500);
    taskScheduler.addScheduledTask(hidCommunicaitonRxTask, "Hid Rx", REPETITION_INTERVAL_HID_RX_TASK, TASK_PRIORITY_HID_RX_TASK, CORE_ID_HID_RX_TASK, STACK_SIZE_HID_RX_TASK);
    taskScheduler.addScheduledTask(hidCommunicaitonTxTask, "Hid Tx", REPETITION_INTERVAL_HID_TX_TASK, TASK_PRIORITY_HID_TX_TASK, CORE_ID_HID_TX_TASK, STACK_SIZE_HID_TX_TASK);
    /*
    ActiveSerial->print("[L]HID descriptor Size:");
    ActiveSerial->println(reportSize);
    ActiveSerial->print("[L]HID descriptor:");
    for(int i =0; i<reportSize;i++)
    {
      ActiveSerial->print("0x");  
      if (hidDescriptorBufferForCheck[i] < 16) ActiveSerial->print('0');
      ActiveSerial->print(hidDescriptorBufferForCheck[i], HEX);
      ActiveSerial->print("-");

