orosys/DIY-Sim-Racing-FFB-Pedal/ESP32_master/src/Main.cpp
    }
    ActiveSerial->println("");
    */
  #endif
  //create message queue
  g_messageQueueHandle_pv = xQueueCreate(10, sizeof(PayloadHidMessage_t));
  if (g_messageQueueHandle_pv == NULL)
  {
    ActiveSerial->println("[L]Error during xqueue creation.");
    ESP.restart();
  }
  EEPROM.begin(512);
  #ifdef ESPNow_Pairing_function
    //button read setup
    pinMode(Pairing_GPIO, INPUT_PULLUP);
  #endif
  #if !defined(CONFIG_IDF_TARGET_ESP32S3) && !defined(CONFIG_IDF_TARGET_ESP32C6)
    disableCore0WDT();
    disableCore1WDT();
  #endif
  //enable ESP-NOW
  espNowInitialize();
  
  #ifdef Using_MCP4728
    MCP4728_I2C.begin(MCP_SDA,MCP_SCL,400000);
    uint8_t i2c_address[8]={0x60,0x61,0x62,0x63,0x64,0x65,0x66,0x67};
    int index_address=0;
    int found_address=0;
    int error;
    for(index_address=0;index_address<8;index_address++)
    {
      MCP4728_I2C.beginTransmission(i2c_address[index_address]);
      error = MCP4728_I2C.endTransmission();
      if (error == 0)
      {
        ActiveSerial->print("I2C device found at address");
        ActiveSerial->print(i2c_address[index_address]);
        ActiveSerial->println("  !");
        found_address=index_address;
        break;
        
      }
      else
      {
        ActiveSerial->print("try address");
        ActiveSerial->println(i2c_address[index_address]);
      }
    }
    
    if(mcp.begin(i2c_address[found_address], &MCP4728_I2C)==false)
    {
      ActiveSerial->println("Couldn't find MCP4728, will not have analog output");
      MCP_status=false;
    }
    else
    {
      ActiveSerial->println("MCP4728 founded");
      MCP_status=true;
      //MCP.begin();
    }
    
  #endif
        
  //initialize time_record
  uint8_t pedalIDX;
  for(pedalIDX=0;pedalIDX<3;pedalIDX++)
  {
    g_pedalLastUpdate_au32[pedalIDX]=millis();
  }
  #ifdef LED_ENABLE_WAVESHARE
    pixels.begin();
    pixels.setBrightness(20);
    pixels.setPixelColor(0,0xff,0xff,0xff);
    pixels.show();
    /*
    xTaskCreatePinnedToCore(
                          ledUpdateTask,   
                          "LED_update_Task", 
                          3000,  
                          //STACK_SIZE_FOR_TASK_2,    
                          NULL,      
                          1,         
                          &Task3,    
                          0);     
                          */
    taskScheduler.addScheduledTask(ledUpdateTask, "LED Update", REPETITION_INTERVAL_LED_UPDATE_TASK, TASK_PRIORITY_LED_UPDATE_TASK, CORE_ID_LED_UPDATE_TASK, STACK_SIZE_LED_UPDATE_TASK);
    delay(500);
  #endif
  #ifdef LED_ENABLE_DONGLE
    pixels.begin();
    pixels.setBrightness(20);
    pixels.setPixelColor(0,0xff,0xff,0xff);
    pixels.show();
    /*
    xTaskCreatePinnedToCore(
                          LED_Task_Dongle,   
                          "LED_update_Task", 
                          3000,  
                          //STACK_SIZE_FOR_TASK_2,    
                          NULL,      
                          1,         
                          &Task3,    
                          0);
    */
    taskScheduler.addScheduledTask(ledUpdateDongleTask, "LED Update for Dongle", REPETITION_INTERVAL_LED_UPDATE_TASK, TASK_PRIORITY_LED_UPDATE_TASK, CORE_ID_LED_UPDATE_TASK, STACK_SIZE_LED_UPDATE_TASK);
    delay(500);
  #endif
  #ifdef Fanatec_comunication
    // Initialize FanatecInterface
    fanatec.begin();

    // Set connection callback
    fanatec.onConnected([](bool connected) {        
      if (connected) {
        ActiveSerial->println("[L] FANATEC Connected to Wheelbase.");
      } else {
        ActiveSerial->println("[L] FANATEC Disconnected from Wheelbase.");
      }
    });
    delay(2000);
    taskScheduler.addScheduledTask(fanatecUpdateTask, "FANATEC Update", REPETITION_INTERVAL_FANATEC_UPDATE_TASK,TASK_PRIORITY_FANATEC_UPDATE_TASK ,CORE_ID_FANATEC_UPDATE_TASK , STACK_SIZE_FANATEC_UPDATE_TASK);
    delay(500);
  #endif

  #ifdef OTA_Update
    taskScheduler.addScheduledTask(otaUpdateTask, "OTA Update", REPETITION_INTERVAL_OTA_UPDATE_TASK, TASK_PRIORITY_OTA_UPDATE_TASK, CORE_ID_OTA_UPDATE_TASK, STACK_SIZE_OTA_UPDATE_TASK);
  #endif
  
  //initialize wifi 
  for(uint i=0;i<30;i++)
  {
    dap_action_ota_st.payloadOtaInfo_st.wifiPass_au8[i]=0;
    dap_action_ota_st.payloadOtaInfo_st.wifiSsid_au8[i]=0;
  }
  //task scheduler adding task
  ActiveSerial->println("[L]Initializing task scheduler...");
  
  taskScheduler.addScheduledTask(serialCommunicationRxTask, "Seria RX", REPETITION_INTERVAL_SERIAL_RX_TASK, TASK_PRIORITY_SERIAL_RX_TASK, CORE_ID_SERIAL_RX_TASK, STACK_SIZE_SERIAL_RX_TASK);
  taskScheduler.addScheduledTask(serialCommunicationTxTask, "Seria TX", REPETITION_INTERVAL_SERIAL_TX_TASK, TASK_PRIORITY_SERIAL_TX_TASK, CORE_ID_SERIAL_TX_TASK, STACK_SIZE_SERIAL_TX_TASK);
  taskScheduler.addScheduledTask(espNowCommunicationTxTask, "Espnow tx", REPETITION_INTERVAL_ESPNOW_TX_TASK, TASK_PRIORITY_ESPNOW_TX_TASK, CORE_ID_ESPNOW_TX_TASK, STACK_SIZE_ESPNOW_TX_TASK);
  taskScheduler.addScheduledTask(joystickUpdateTask, "Joystick Update", REPETITION_INTERVAL_JOYSTICK_UPDATE_TASK, TASK_PRIORITY_JOYSTICK_UPDATE_TASK, CORE_ID_JOYSTICK_UPDATE_TASK, STACK_SIZE_JOYSTICK_UPDATE_TASK);
  taskScheduler.addScheduledTask(miscTask, "MISC", REPETITION_INTERVAL_MISC_TASK, TASK_PRIORITY_MISC_TASK, CORE_ID_MISC_TASK, STACK_SIZE_MISC_TASK);
  
  delay(100);
  taskScheduler.begin();

  ActiveSerial->println("[L]Setup end");
  #ifdef USB_JOYSTICK
    delay(2000);
    tinyusbJoystick_.printf("Bridge setup end.");
  #endif
  
  
}

//espnow communication task
uint32_t loop_count=0;
bool basic_rssi_update=false;
unsigned long bridge_state_last_update=millis();
unsigned long Pairing_state_start;
unsigned long Pairing_state_last_sending;
uint8_t press_count=0;
uint Pairing_timeout=20000;
bool Pairing_timeout_status=false;
bool building_dap_esppairing_lcl =false;
void loop() 
{
  taskYIELD();
  delay(10000);
}

inline void syncPairingTableToPedals()
{
  DapAssignmentReg_t pairSync = {};
  pairSync.payloadType_u8 = DAP_PAYLOAD_TYPE_ASSIGNMENT_U8;
  pairSync.magicKey_u8 = ESPNOW_ASSIGNMENT_MAGIC_KEY_U8;
  pairSync.isAdvancedPaired_u8 = 1;
  for (int p = 0; p < 3; p++) {
    bool hasMac = false;
    for (int b = 0; b < 6; b++) {
      if (g_pedalMac_aau8[p][b] != 0) {
        hasMac = true;
        break;
      }
    }
    if (hasMac) {
      pairSync.pairStatus_au8[p] = 1;
      memcpy(pairSync.pairedMac_aau8[p], g_pedalMac_aau8[p], 6);
    } else {
      pairSync.pairStatus_au8[p] = 0;
      memset(pairSync.pairedMac_aau8[p], 0, 6);
    }
  }
  pairSync.pairStatus_au8[3] = 1;
  memcpy(pairSync.pairedMac_aau8[3], g_espMac_au8, 6);

  for (int p = 0; p < 3; p++) {
    if (pairSync.pairStatus_au8[p] == 1) {
      pairSync.deviceId_u8 = p;
      pairSync.crc_u16 = checksumCalculator((uint8_t*)(&pairSync), sizeof(DapAssignmentReg_t) - sizeof(uint16_t));
      ESPNow.send_message(g_pedalMac_aau8[p], (uint8_t*)&pairSync, sizeof(DapAssignmentReg_t));
    }
  }
}

void espNowCommunicationTxTask( void * pvParameters )
{
  for(;;)
  {
    if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0) 
    {
      #ifdef ESPNow_Pairing_function
        if(digitalRead(Pairing_GPIO)==LOW||g_softwarePairingAction_b)
        {
          ActiveSerial->println("[L]Bridge Pairing.....");
          delay(1000);
          Pairing_state_start=millis();
          Pairing_state_last_sending=millis();
          g_espNowPairingAction_b=true;
          building_dap_esppairing_lcl=true;
          LED_Status=1;
          g_softwarePairingAction_b=false;
        }
        if(g_espNowPairingAction_b)
        {
          unsigned long now=millis();
          //sending package
          if(building_dap_esppairing_lcl)
          {
            uint16_t crc=0;          
            building_dap_esppairing_lcl=false;
            dap_esppairing_lcl.payloadEspnowInfo_st.deviceId_u8=deviceID;
            dap_esppairing_lcl.payloadHeader_st.payloadType=DAP_PAYLOAD_TYPE_ESPNOW_PAIRING;
            dap_esppairing_lcl.payloadHeader_st.pedalTag_u8=deviceID;
            dap_esppairing_lcl.payloadHeader_st.version=DAP_VERSION_CONFIG;
            crc = checksumCalculator((uint8_t*)(&(dap_esppairing_lcl.payloadHeader_st)), sizeof(dap_esppairing_lcl.payloadHeader_st) + sizeof(dap_esppairing_lcl.payloadEspnowInfo_st));
            dap_esppairing_lcl.payloadFooter_st.checkSum_u16=crc;
          }
          if(now-Pairing_state_last_sending>400)
          {
            Pairing_state_last_sending=now;
            ESPNow.send_message(g_broadcastMac_au8,(uint8_t *) &dap_esppairing_lcl, sizeof(dap_esppairing_lcl));
          }
          

          //timeout check
          if(now-Pairing_state_start>Pairing_timeout)
          {
            ActiveSerial->println("[L]Bridge Pairing timeout!");
            g_espNowPairingAction_b=false;
            LED_Status=0;
            if(g_updatePairingToEeprom_b)
            {
              EEPROM.put(EEPROM_offset,g_espPairingReg_st);
              EEPROM.commit();
              g_updatePairingToEeprom_b=false;
              
              //list eeprom
              EspPairingReg_t ESP_pairing_reg_local;
              EEPROM.get(EEPROM_offset, ESP_pairing_reg_local);
              for(int i=0;i<4;i++)
              {
                if(ESP_pairing_reg_local.pairStatus_au8[i]==1)
                {                
                  ActiveSerial->print("[L]#");
                  ActiveSerial->print(i);
                  ActiveSerial->print("Pair: ");
                  ActiveSerial->print(ESP_pairing_reg_local.pairStatus_au8[i]);
                  ActiveSerial->printf(" Mac: %02X:%02X:%02X:%02X:%02X:%02X", ESP_pairing_reg_local.pairMac_aau8[i][0], ESP_pairing_reg_local.pairMac_aau8[i][1], ESP_pairing_reg_local.pairMac_aau8[i][2], ESP_pairing_reg_local.pairMac_aau8[i][3], ESP_pairing_reg_local.pairMac_aau8[i][4], ESP_pairing_reg_local.pairMac_aau8[i][5]);
                  ActiveSerial->println("");
                }
                ActiveSerial->println("");
              }
              ActiveSerial->println("");
              //adding peer
              /*
              for(int i=0; i<4;i++)
              {
                if(g_espPairingReg_st.pairStatus_au8[i]==1)
                {
                  if(i==0)
                  {
                    ESPNow.remove_peer(g_pedalMac_aau8[0]);
                    memcpy(&g_pedalMac_aau8[0],&g_espPairingReg_st.pairMac_aau8[i],6);
                    delay(300);
                    ESPNow.add_peer(g_pedalMac_aau8[0]);
                    
