orosys/DIY-Sim-Racing-FFB-Pedal/ESP32_master/src/Main.cpp
                  }
                  if(i==1)
                  {
                    ESPNow.remove_peer(g_pedalMac_aau8[1]);
                    memcpy(&g_pedalMac_aau8[1],&g_espPairingReg_st.pairMac_aau8[i],6);
                    delay(300);
                    ESPNow.add_peer(g_pedalMac_aau8[1]);
                    //ActiveSerial->printf("[L]Mac: %02X:%02X:%02X:%02X:%02X:%02X\n", g_pedalMac_aau8[1][0], g_pedalMac_aau8[1][1], g_pedalMac_aau8[1][2], g_pedalMac_aau8[1][3], g_pedalMac_aau8[1][4], g_pedalMac_aau8[1][5]);

                  }
                  if(i==2)
                  {
                    ESPNow.remove_peer(g_pedalMac_aau8[2]);
                    memcpy(&g_pedalMac_aau8[2],&g_espPairingReg_st.pairMac_aau8[i],6);
                    delay(300);
                    ESPNow.add_peer(g_pedalMac_aau8[2]);
                  }        
                  if(i==3)
                  {
                    ESPNow.remove_peer(g_espHost_au8);
                    memcpy(&g_espHost_au8,&g_espPairingReg_st.pairMac_aau8[i],6);
                    delay(300);
                    ESPNow.add_peer(g_espHost_au8);                
                  }        
                }
              }
              */
            }
            
          }
        }
      #endif
      // 1 Hz sync beacon broadcast
      static unsigned long s_lastWifiBeacon_ms = 0;
      if (millis() - s_lastWifiBeacon_ms >= 400)
      {
        s_lastWifiBeacon_ms = millis();
        DapWifiChannel_t beacon = {};
        beacon.payloadHeader_st.startOfFrame0_u8 = SOF_BYTE_0_U8;
        beacon.payloadHeader_st.startOfFrame1_u8 = SOF_BYTE_1_U8;
        beacon.payloadHeader_st.payloadType_u8 = DAP_PAYLOAD_TYPE_WIFI_CHANNEL_U8;
        beacon.payloadHeader_st.version_u8 = DAP_VERSION_CONFIG_U8;
        beacon.payloadHeader_st.pedalTag_u8 = 3;
        beacon.payloadWifiChannel_st.command_u8 = WIFI_CH_CMD_BEACON;
        beacon.payloadWifiChannel_st.currentChannel_u8 = g_currentWifiChannel_u8;
        beacon.payloadWifiChannel_st.recommendedChannel_u8 = g_currentWifiChannel_u8;
        beacon.payloadFooter_st.enfOfFrame0_u8 = EOF_BYTE_0_U8;
        beacon.payloadFooter_st.enfOfFrame1_u8 = EOF_BYTE_1_U8;
        beacon.payloadFooter_st.checkSum_u16 = checksumCalculator((uint8_t*)(&(beacon.payloadHeader_st)), sizeof(beacon.payloadHeader_st) + sizeof(beacon.payloadWifiChannel_st));
        ESPNow.send_message(g_broadcastMac_au8, (uint8_t*)&beacon, sizeof(DapWifiChannel_t));
      }

      for(int i=0;i<3;i++)
      {
        if(configUpdateAvailable[i])
        {
          configUpdateAvailable[i] = false;
          if(dap_bridge_state_st.payloadBridgeState_st.pedalAvailability_au8[i]==1)
          {
            esp_err_t err;
            switch (i)
            {
              case PEDAL_ID_CLUTCH:
                ActiveSerial->print("[L]Sending Clutch config,Result:");
                err = ESPNow.send_message(g_pedalMac_aau8[0], (uint8_t *)&dap_config_st[i], sizeof(DapConfig_t));
                break;
              case PEDAL_ID_BRAKE:
                ActiveSerial->print("[L]Sending Brake config,Result:");
                err = ESPNow.send_message(g_pedalMac_aau8[1], (uint8_t *)&dap_config_st[i], sizeof(DapConfig_t));
                break;
              case PEDAL_ID_THROTTLE:
                ActiveSerial->print("[L]Sending Throttle config,Result:");
                err = ESPNow.send_message(g_pedalMac_aau8[2], (uint8_t *)&dap_config_st[i], sizeof(DapConfig_t));
                
                break;
              default:
                break;
            }
            ActiveSerial->println(esp_err_to_name(err));
            #ifdef USB_JOYSTICK
              tinyusbJoystick_.printf("Forward config to Pedal: %d, result:%s", i, esp_err_to_name(err));
            #endif
          }
        }
      }
      

      for(int i=0; i<3; i++)
      {
        if(dap_action_update[i] )
        {
          dap_action_update[i]=false;
          if(dap_bridge_state_st.payloadBridgeState_st.pedalAvailability_au8[i]==1)
          {
            switch (i)
            {
              case PEDAL_ID_CLUTCH:
                ESPNow.send_message(g_pedalMac_aau8[0],(uint8_t *) &dap_actions_st[i],sizeof(DapActions_t));
                break;
              case PEDAL_ID_BRAKE:
                if (dap_actions_st[i].payloadPedalAction_st.rudderAction_u8 != 0 &&
                    dap_actions_st[i].payloadPedalAction_st.systemAction_u8 == 0) {
                  syncPairingTableToPedals();
                }
                ESPNow.send_message(g_pedalMac_aau8[1],(uint8_t *) &dap_actions_st[i],sizeof(DapActions_t));
                break;
              case PEDAL_ID_THROTTLE:
                ESPNow.send_message(g_pedalMac_aau8[2],(uint8_t *) &dap_actions_st[i],sizeof(DapActions_t));
                break;
              default:
                break;
            }
          }
        }

        // --- ADDED: Forward Servo Config to Pedals ---
        for(int s=0; s<3; s++)
        {
          if(update_servo_config[s])
          {
            update_servo_config[s] = false;
            if(dap_bridge_state_st.payloadBridgeState_st.pedalAvailability_au8[s]==1)
            {
              switch (s)
              {
                case PEDAL_ID_CLUTCH:   ESPNow.send_message(g_pedalMac_aau8[0],(uint8_t *) &dap_servo_config_st[s],sizeof(DAP_servo_config_st_t)); break;
                case PEDAL_ID_BRAKE:    ESPNow.send_message(g_pedalMac_aau8[1],(uint8_t *) &dap_servo_config_st[s],sizeof(DAP_servo_config_st_t)); break;
                case PEDAL_ID_THROTTLE: ESPNow.send_message(g_pedalMac_aau8[2],(uint8_t *) &dap_servo_config_st[s],sizeof(DAP_servo_config_st_t)); break;
              }
            }
          }
        }

      }


    
      //forward the basic wifi info for pedals
      if(g_pedalOtaAction_b)
      {
        switch(dap_action_ota_st.payloadOtaInfo_st.deviceId_u8)
        {
          case 0:
            ESPNow.send_message(g_pedalMac_aau8[0],(uint8_t *) &dap_action_ota_st,sizeof(DapActionOta_t));
            ActiveSerial->println("[L]Forward OTA command to Clutch");
          break;
          case 1:
            ESPNow.send_message(g_pedalMac_aau8[1],(uint8_t *) &dap_action_ota_st,sizeof(DapActionOta_t));
            ActiveSerial->println("[L]Forward OTA command to Brake");
          break;
          case 2:
            ESPNow.send_message(g_pedalMac_aau8[2],(uint8_t *) &dap_action_ota_st,sizeof(DapActionOta_t));
            ActiveSerial->println("[L]Forward OTA command to Throttle");
          break;
        }
        g_pedalOtaAction_b=false;
      }
    }    
  }
}


void clearPedalAssignmentAction(uint8_t targetIdx, const DapActions_t &action)
{
  if (targetIdx > 2) return;
  uint8_t targetMac[6] = {0};
  bool hasMac = false;
  for (int b = 0; b < 6; b++) {
    if (g_pedalMac_aau8[targetIdx][b] != 0) {
      hasMac = true;
      break;
    }
  }
  if (!hasMac) {
    for (int b = 0; b < 6; b++) {
      if (g_espPairingReg_st.pairMac_aau8[targetIdx][b] != 0) {
        hasMac = true;
        break;
      }
    }
    if (hasMac) {
      memcpy(targetMac, g_espPairingReg_st.pairMac_aau8[targetIdx], 6);
    }
  } else {
    memcpy(targetMac, g_pedalMac_aau8[targetIdx], 6);
  }

  if (hasMac) {
    if (!esp_now_is_peer_exist(targetMac)) {
      esp_now_peer_info_t peerInfo = {};
      memcpy(peerInfo.peer_addr, targetMac, 6);
      peerInfo.channel = 0;
      peerInfo.ifidx = WIFI_IF_STA;
      peerInfo.encrypt = false;
      esp_now_add_peer(&peerInfo);
    }
    for (int retry = 0; retry < 5; retry++) {
      ESPNow.send_message(targetMac, (uint8_t*)&action, sizeof(DapActions_t));
      delay(20);
    }
  }

  // Clear pairing in EEPROM & RAM
  g_espPairingReg_st.pairStatus_au8[targetIdx] = 0;
  memset(g_espPairingReg_st.pairMac_aau8[targetIdx], 0, 6);
  EEPROM.put(EEPROM_offset, g_espPairingReg_st);
  EEPROM.commit();
  memset(g_pedalMac_aau8[targetIdx], 0, 6);
  dap_bridge_state_st.payloadBridgeState_st.pedalAvailability_au8[targetIdx] = 0;

  ActiveSerial->printf("[L]Cleared assignment for pedal %d and sent CLEAR_ASSIGNMENT action\n", targetIdx);
  syncPairingTableToPedals();
}

void pushPedalAssignmentAction(uint8_t sourceTag, uint8_t newRole, const DapActions_t &action)
{
  if (newRole > 2) {
    ActiveSerial->printf("[L]pushPedalAssignmentAction: invalid target role %d\n", newRole);
    return;
  }
  if (sourceTag > 7) {
    ActiveSerial->printf("[L]pushPedalAssignmentAction: invalid source tag %d\n", sourceTag);
    return;
  }

  uint8_t targetMac[6] = {0};
  bool foundMac = false;

