orosys/DIY-Sim-Racing-FFB-Pedal/ESP32_master/src/Main.cpp
  // Prüfe ob Quell-MAC in g_pedalMac_aau8 liegt
  for (int b = 0; b < 6; b++) {
    if (g_pedalMac_aau8[sourceTag][b] != 0) {
      foundMac = true;
      break;
    }
  }
  if (foundMac) {
    memcpy(targetMac, g_pedalMac_aau8[sourceTag], 6);
  } else {
    ActiveSerial->printf("[L]pushPedalAssignmentAction: No MAC known for tag %d\n", sourceTag);
    return;
  }

  // Per ESP-NOW direkt an die MAC-Adresse des Pedals senden
  if (!esp_now_is_peer_exist(targetMac)) {
    esp_now_peer_info_t peerInfo = {};
    memcpy(peerInfo.peer_addr, targetMac, 6);
    peerInfo.channel = 0;
    peerInfo.ifidx = WIFI_IF_STA;
    peerInfo.encrypt = false;
    esp_now_add_peer(&peerInfo);
  }

  for (int retry = 0; retry < 3; retry++) {
    ESPNow.send_message(targetMac, (uint8_t*)&action, sizeof(DapActions_t));
    delay(20);
  }
  ActiveSerial->printf("[L]Assignment action sent to pedal: %02X:%02X:%02X:%02X:%02X:%02X, new role: %d\n",
                       targetMac[0], targetMac[1], targetMac[2], targetMac[3], targetMac[4], targetMac[5], newRole);

  // Bridge merkt sich die MAC-Adresse im RAM & EEPROM
  if (sourceTag != newRole) {
    memcpy(g_pedalMac_aau8[newRole], targetMac, 6);
    if (sourceTag >= 3) {
      memset(g_pedalMac_aau8[sourceTag], 0, 6);
    }

    memcpy(g_espPairingReg_st.pairMac_aau8[newRole], targetMac, 6);
    g_espPairingReg_st.pairStatus_au8[newRole] = 1;
    EEPROM.put(EEPROM_offset, g_espPairingReg_st);
    EEPROM.commit();

    syncPairingTableToPedals();
  }
}

//serial communication recieve task
bool PedalUpdateIntervalPrint_b=false;
unsigned long PedalUpdateLast=0;
unsigned long UARTJoystickUpdateLast=0;
bool isBridgeInDebugMode_b=false;
bool UARTJoystickUpdate_b=false;
int joystick_fake_value=0;

typedef struct {
    uint16_t startBytePos_u16;
    uint16_t endBytePos_u16;
    uint16_t payloadType_u16;
    bool validFlag_b;
} structChecker_st;

// Helper function to determine expected packet size from payload type
// Returns 0 if the payload type is unknown.
static inline size_t getExpectedPacketSize(uint8_t payloadType) {
    switch (payloadType) {
        case DAP_PAYLOAD_TYPE_CONFIG_U8:
            return sizeof(DapConfig_t);
        case DAP_PAYLOAD_TYPE_ACTION_U8:
            return sizeof(DapActions_t);
        case DAP_PAYLOAD_TYPE_ACTION_OTA_U8:
            return sizeof(DapActionOta_t);
        case DAP_PAYLOAD_TYPE_BRIDGE_STATE_U8:
            return sizeof(DapBridgeState_t);
        case DAP_PAYLOAD_TYPE_SERVO_CONFIG_U8:
            return sizeof(DAP_servo_config_st_t);
        case DAP_PAYLOAD_TYPE_WIFI_CHANNEL_U8:
            return sizeof(DapWifiChannel_t);
        // Add other packet types here in the future
        default:
            return 0;
    }
}
void handleWifiScanRequest(bool isHid) {
  ActiveSerial->println("[L]Scanning Wi-Fi channels...");
  int n = WiFi.scanNetworks(false, true);
  int apCount[15] = {0};
  int bestRssi[15];
  for (int i = 0; i < 15; i++) bestRssi[i] = -120;
  int score[15] = {0};

  for (int i = 0; i < n; i++) {
    int ch = WiFi.channel(i);
    int32_t rssi = WiFi.RSSI(i);
    if (ch >= 1 && ch <= 13) {
      apCount[ch]++;
      if (rssi > bestRssi[ch]) {
        bestRssi[ch] = rssi;
      }
      int weight = constrain((int)(rssi + 110) / 2, 5, 50);
      score[ch] += weight;
      if (ch > 1) score[ch - 1] += weight / 2;
      if (ch < 13) score[ch + 1] += weight / 2;
      if (ch > 2) score[ch - 2] += weight / 4;
      if (ch < 12) score[ch + 2] += weight / 4;
    }
  }
  WiFi.scanDelete();

  esp_wifi_set_channel(g_currentWifiChannel_u8, WIFI_SECOND_CHAN_NONE);

  uint8_t recommended = 1;
  int minScore = score[1];
  if (score[6] < minScore) {
    minScore = score[6];
    recommended = 6;
  }
  if (score[11] < minScore) {
    minScore = score[11];
    recommended = 11;
  }

  DapWifiChannel_t resp = {};
  resp.payloadHeader_st.startOfFrame0_u8 = SOF_BYTE_0_U8;
  resp.payloadHeader_st.startOfFrame1_u8 = SOF_BYTE_1_U8;
  resp.payloadHeader_st.payloadType_u8 = DAP_PAYLOAD_TYPE_WIFI_CHANNEL_U8;
  resp.payloadHeader_st.version_u8 = DAP_VERSION_CONFIG_U8;
  resp.payloadHeader_st.pedalTag_u8 = 3;
  resp.payloadWifiChannel_st.command_u8 = WIFI_CH_CMD_SCAN_RES;
  resp.payloadWifiChannel_st.currentChannel_u8 = g_currentWifiChannel_u8;
  resp.payloadWifiChannel_st.recommendedChannel_u8 = recommended;
  resp.payloadWifiChannel_st.channel1Rssi_i8 = (bestRssi[1] > -120) ? (int8_t)bestRssi[1] : (int8_t)0;
  resp.payloadWifiChannel_st.channel6Rssi_i8 = (bestRssi[6] > -120) ? (int8_t)bestRssi[6] : (int8_t)0;
  resp.payloadWifiChannel_st.channel11Rssi_i8 = (bestRssi[11] > -120) ? (int8_t)bestRssi[11] : (int8_t)0;
  resp.payloadWifiChannel_st.channel1ApCount_u8 = (uint8_t)constrain(apCount[1], 0, 255);
  resp.payloadWifiChannel_st.channel6ApCount_u8 = (uint8_t)constrain(apCount[6], 0, 255);
  resp.payloadWifiChannel_st.channel11ApCount_u8 = (uint8_t)constrain(apCount[11], 0, 255);
  resp.payloadWifiChannel_st.channel1ApScore_u8 = (uint8_t)constrain(score[1], 0, 100);
  resp.payloadWifiChannel_st.channel6ApScore_u8 = (uint8_t)constrain(score[6], 0, 100);
  resp.payloadWifiChannel_st.channel11ApScore_u8 = (uint8_t)constrain(score[11], 0, 100);
  resp.payloadFooter_st.enfOfFrame0_u8 = EOF_BYTE_0_U8;
  resp.payloadFooter_st.enfOfFrame1_u8 = EOF_BYTE_1_U8;
  resp.payloadFooter_st.checkSum_u16 = checksumCalculator((uint8_t*)(&(resp.payloadHeader_st)), sizeof(resp.payloadHeader_st) + sizeof(resp.payloadWifiChannel_st));

#ifdef USB_JOYSTICK
  if (isHid) {
    tinyusbJoystick_.sendData((uint8_t*)&resp, sizeof(DapWifiChannel_t));
  } else {
    ActiveSerial->write((uint8_t*)&resp, sizeof(DapWifiChannel_t));
  }
#else
  ActiveSerial->write((uint8_t*)&resp, sizeof(DapWifiChannel_t));
#endif
  ActiveSerial->printf("[L]Scan done. Best channel: %d (Score Ch1: %d, Ch6: %d, Ch11: %d)\n", recommended, score[1], score[6], score[11]);
}

void handleWifiSetChannelRequest(uint8_t newChannel, bool isHid) {
  if (newChannel < 1 || newChannel > 14) return;
  ActiveSerial->printf("[L]Switching Wi-Fi channel from %d to %d...\n", g_currentWifiChannel_u8, newChannel);

  DapWifiChannel_t fwd = {};
  fwd.payloadHeader_st.startOfFrame0_u8 = SOF_BYTE_0_U8;
  fwd.payloadHeader_st.startOfFrame1_u8 = SOF_BYTE_1_U8;
  fwd.payloadHeader_st.payloadType_u8 = DAP_PAYLOAD_TYPE_WIFI_CHANNEL_U8;
  fwd.payloadHeader_st.version_u8 = DAP_VERSION_CONFIG_U8;
  fwd.payloadHeader_st.pedalTag_u8 = 3;
  fwd.payloadWifiChannel_st.command_u8 = WIFI_CH_CMD_SET_REQ;
  fwd.payloadWifiChannel_st.currentChannel_u8 = newChannel;
  fwd.payloadWifiChannel_st.recommendedChannel_u8 = newChannel;
  fwd.payloadFooter_st.enfOfFrame0_u8 = EOF_BYTE_0_U8;
  fwd.payloadFooter_st.enfOfFrame1_u8 = EOF_BYTE_1_U8;
  fwd.payloadFooter_st.checkSum_u16 = checksumCalculator((uint8_t*)(&(fwd.payloadHeader_st)), sizeof(fwd.payloadHeader_st) + sizeof(fwd.payloadWifiChannel_st));

