orosys/DIY-Sim-Racing-FFB-Pedal/ESP32_master/src/Main.cpp
  // Staggered multi-unicast to paired pedals and broadcast over ~200ms
  for (int k = 0; k < 4; k++) {
    for (int p = 0; p < 3; p++) {
      if (g_espPairingReg_st.pairStatus_au8[p] == 1) {
        ESPNow.send_message(g_pedalMac_aau8[p], (uint8_t*)&fwd, sizeof(DapWifiChannel_t));
      }
    }
    ESPNow.send_message(g_broadcastMac_au8, (uint8_t*)&fwd, sizeof(DapWifiChannel_t));
    delay(50);
  }

  saveWifiChannelToEeprom(newChannel);
  g_currentWifiChannel_u8 = newChannel;

  delay(20);
  esp_wifi_set_channel(newChannel, WIFI_SECOND_CHAN_NONE);

  fwd.payloadWifiChannel_st.command_u8 = WIFI_CH_CMD_SET_ACK;
  fwd.payloadWifiChannel_st.currentChannel_u8 = newChannel;
  fwd.payloadFooter_st.checkSum_u16 = checksumCalculator((uint8_t*)(&(fwd.payloadHeader_st)), sizeof(fwd.payloadHeader_st) + sizeof(fwd.payloadWifiChannel_st));
#ifdef USB_JOYSTICK
  if (isHid) {
    tinyusbJoystick_.sendData((uint8_t*)&fwd, sizeof(DapWifiChannel_t));
  } else {
    ActiveSerial->write((uint8_t*)&fwd, sizeof(DapWifiChannel_t));
  }
#else
  ActiveSerial->write((uint8_t*)&fwd, sizeof(DapWifiChannel_t));
#endif
  ActiveSerial->printf("[L]Wi-Fi channel successfully switched to %d.\n", newChannel);
}

void sendWifiChannelStatus(bool isHid) {
  DapWifiChannel_t fwd = {};
  fwd.payloadHeader_st.startOfFrame0_u8 = SOF_BYTE_0_U8;
  fwd.payloadHeader_st.startOfFrame1_u8 = SOF_BYTE_1_U8;
  fwd.payloadHeader_st.payloadType_u8 = DAP_PAYLOAD_TYPE_WIFI_CHANNEL_U8;
  fwd.payloadHeader_st.version_u8 = DAP_VERSION_CONFIG_U8;
  fwd.payloadHeader_st.pedalTag_u8 = 3;
  fwd.payloadWifiChannel_st.command_u8 = WIFI_CH_CMD_SET_ACK;
  fwd.payloadWifiChannel_st.currentChannel_u8 = g_currentWifiChannel_u8;
  fwd.payloadWifiChannel_st.recommendedChannel_u8 = g_currentWifiChannel_u8;
  fwd.payloadFooter_st.enfOfFrame0_u8 = EOF_BYTE_0_U8;
  fwd.payloadFooter_st.enfOfFrame1_u8 = EOF_BYTE_1_U8;
  fwd.payloadFooter_st.checkSum_u16 = checksumCalculator((uint8_t*)(&(fwd.payloadHeader_st)), sizeof(fwd.payloadHeader_st) + sizeof(fwd.payloadWifiChannel_st));
#ifdef USB_JOYSTICK
  if (isHid) {
    tinyusbJoystick_.sendData((uint8_t*)&fwd, sizeof(DapWifiChannel_t));
  } else {
    ActiveSerial->write((uint8_t*)&fwd, sizeof(DapWifiChannel_t));
  }
#else
  ActiveSerial->write((uint8_t*)&fwd, sizeof(DapWifiChannel_t));
#endif
}

void serialCommunicationRxTask( void * pvParameters)
{
  // Buffer to accumulate incoming serial data
  const size_t RX_BUFFER_SIZE = 1028; // Should be at least 2x the largest possible packet
  static uint8_t rx_buffer[RX_BUFFER_SIZE];
  static size_t buffer_len = 0;
  //configDataPackage_t configPackage_st;
  for(;;)
  {
    if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0) 
    {
      //ActiveSerial->println("RX kick");
      // --- 1. Read all available data into our buffer ---
      if (ActiveSerial->available())
      {
        // Prevent buffer overflow by only reading what fits
        size_t bytesToRead = min((size_t)ActiveSerial->available(), RX_BUFFER_SIZE - buffer_len);
        if (bytesToRead > 0)
        {
          ActiveSerial->readBytes(&rx_buffer[buffer_len], bytesToRead);
          buffer_len += bytesToRead;
        }

        // ActiveSerial->println("Serial data available");
      }

      // --- 2. Process all complete packets in the buffer ---
      size_t buffer_idx = 0;
      while (buffer_idx < buffer_len)
      {
        // A. Find the next valid Start-of-Frame (SOF)
        if (rx_buffer[buffer_idx] != SOF_BYTE_0_U8 || (buffer_idx + 1 < buffer_len && rx_buffer[buffer_idx + 1] != SOF_BYTE_1_U8))
        {
          buffer_idx++;
          continue; // Keep scanning for a SOF
        }

        // ActiveSerial->println("1st check passed");

        // SOF found at buffer_idx. Check if we have enough data for a header.
        if (buffer_len < buffer_idx + 3)
        {
          // Not enough data for a full header, stop parsing for now
          break;
        }

        // B. Get expected packet size from payload type
        uint8_t payloadType = rx_buffer[buffer_idx + 2];
        size_t expectedSize = getExpectedPacketSize(payloadType);

        if (expectedSize == 0)
        {
          // Unknown payload type, this SOF is corrupt. Skip it and continue scanning.
          buffer_idx++;
          continue;
        }

        // ActiveSerial->println("2nd check passed");

        // C. Check if the full packet has arrived
        if (buffer_len < buffer_idx + expectedSize)
        {
          // Full packet is not yet in the buffer, wait for more data
          break;
        }

        // D. Check for valid End-of-Frame (EOF)
        if (rx_buffer[buffer_idx + expectedSize - 2] != EOF_BYTE_0_U8 || rx_buffer[buffer_idx + expectedSize - 1] != EOF_BYTE_1_U8)
        {
          // EOF is wrong, this packet is corrupt. Skip the SOF and continue scanning.
          buffer_idx++;
          continue;
        }

        // --- We have a candidate packet! Now validate and process it. ---
        uint8_t *packet_start = &rx_buffer[buffer_idx];
        bool structIsValid = true;
        uint16_t received_crc = 0;
        uint16_t calculated_crc = 0;

        switch (payloadType)
        {
          //case config
          case DAP_PAYLOAD_TYPE_CONFIG_U8:
          {
            #ifndef USB_JOYSTICK
              bool structChecker = true;
              DapConfig_t dap_config_st_local;
              memcpy(&dap_config_st_local, packet_start, sizeof(DapConfig_t));
              //ActiveSerial->readBytes((char *)&dap_config_st_local, sizeof(DapConfig_t));
              if (dap_config_st_local.payloadHeader_st.payloadType_u8 != DAP_PAYLOAD_TYPE_CONFIG_U8)
              {
                structChecker = false;
                structIsValid=false;
                ActiveSerial->print("[L]Payload type expected: ");
                ActiveSerial->print(DAP_PAYLOAD_TYPE_CONFIG_U8);
                ActiveSerial->print(",   Payload type received: ");
                ActiveSerial->println(dap_config_st_local.payloadHeader_st.payloadType_u8);
              }
              if (dap_config_st_local.payloadHeader_st.version_u8 != DAP_VERSION_CONFIG_U8)
              {
                structChecker = false;
                structIsValid = false;
                ActiveSerial->print("[L]Config version expected: ");
                ActiveSerial->print(DAP_VERSION_CONFIG_U8);
                ActiveSerial->print(",   Config version received: ");
                ActiveSerial->println(dap_config_st_local.payloadHeader_st.version_u8);
              }
              // checksum validation
              uint16_t crc = checksumCalculator((uint8_t *)(&(dap_config_st_local.payloadHeader_st)), sizeof(dap_config_st_local.payloadHeader_st) + sizeof(dap_config_st_local.payloadPedalConfig_st));
              if (crc != dap_config_st_local.payloadFooter_st.checkSum_u16)
              {
                structChecker = false;
                structIsValid = false;
                ActiveSerial->print("[L]CRC expected: ");
                ActiveSerial->print(crc);
                ActiveSerial->print(",   CRC received: ");
                ActiveSerial->println(dap_config_st_local.payloadFooter_st.checkSum_u16);
              }
              // if checks are successfull, overwrite global configuration struct
              if (structChecker == true)
              {
                int pedalIdx = dap_config_st_local.payloadHeader_st.pedalTag_u8;
                // ActiveSerial->println("[L]Updating pedal config");
                memcpy(&dap_config_st[pedalIdx], &dap_config_st_local, sizeof(DapConfig_t));
                configUpdateAvailable[pedalIdx] = true;
              }
            #endif
            break;
          }
          //case action to pedal
          case DAP_PAYLOAD_TYPE_ACTION_U8:
          {
            #ifndef USB_JOYSTICK
              bool structChecker = true;
              DapActions_t dap_actions_st_local;
              memcpy(&dap_actions_st_local, packet_start, sizeof(DapActions_t));
              //memcpy(&dap_actions_st_local, packet_start, sizeof(DapConfig_t));
              //ActiveSerial->readBytes((char *)&dap_actions_st_local, sizeof(DapActions_t));
              if (dap_actions_st_local.payloadHeader_st.payloadType_u8 != DAP_PAYLOAD_TYPE_ACTION_U8)
              {
                structChecker = false;
                structIsValid = false;
                ActiveSerial->print("[L]Payload type expected: ");
                ActiveSerial->print(DAP_PAYLOAD_TYPE_ACTION_U8);
                ActiveSerial->print(",   Payload type received: ");
                ActiveSerial->println(dap_actions_st_local.payloadHeader_st.payloadType_u8);
              }
              if (dap_actions_st_local.payloadHeader_st.version_u8 != DAP_VERSION_CONFIG_U8)
              {
                structChecker = false;
                structIsValid = false;
                ActiveSerial->print("[L]Config version expected: ");
                ActiveSerial->print(DAP_VERSION_CONFIG_U8);
                ActiveSerial->print(",   Config version received: ");
                ActiveSerial->println(dap_actions_st_local.payloadHeader_st.version_u8);
              }

              uint16_t crc = checksumCalculator((uint8_t *)(&(dap_actions_st_local.payloadHeader_st)), sizeof(dap_actions_st_local.payloadHeader_st) + sizeof(dap_actions_st_local.payloadPedalAction_st));
              if (crc != dap_actions_st_local.payloadFooter_st.checkSum_u16)
              {
                structChecker = false;
                structIsValid = false;
                ActiveSerial->print("[L]CRC expected: ");
                ActiveSerial->print(crc);
                ActiveSerial->print(",   CRC received: ");
                ActiveSerial->println(dap_actions_st_local.payloadFooter_st.checkSum_u16);
              }
              if (structChecker == true)
              {
                
                int pedalIdx = dap_actions_st_local.payloadHeader_st.pedalTag_u8;
                uint8_t sysAction = dap_actions_st_local.payloadPedalAction_st.systemAction_u8;
                if (sysAction == (uint8_t)PedalSystemAction::SET_ASSIGNMENT_0) {
                  pushPedalAssignmentAction(pedalIdx, 0, dap_actions_st_local);
                } else if (sysAction == (uint8_t)PedalSystemAction::SET_ASSIGNMENT_1) {
                  pushPedalAssignmentAction(pedalIdx, 1, dap_actions_st_local);
                } else if (sysAction == (uint8_t)PedalSystemAction::SET_ASSIGNMENT_2) {
                  pushPedalAssignmentAction(pedalIdx, 2, dap_actions_st_local);
                } else if (sysAction == (uint8_t)PedalSystemAction::CLEAR_ASSIGNMENT) {
                  clearPedalAssignmentAction(pedalIdx, dap_actions_st_local);
                } else if (sysAction == (uint8_t)PedalSystemAction::ASSIGNMENT_CHECK_BEEP) {
                  if (pedalIdx >= 0 && pedalIdx < 8 && g_pedalMac_aau8[pedalIdx][0] != 0) {
                    ESPNow.send_message(g_pedalMac_aau8[pedalIdx], (uint8_t*)&dap_actions_st_local, sizeof(DapActions_t));
                  }
                } else if(pedalIdx == PEDAL_ID_CLUTCH || pedalIdx == PEDAL_ID_BRAKE || pedalIdx == PEDAL_ID_THROTTLE)
                {
                  //forward to pedal
                  memcpy(&dap_actions_st[pedalIdx], &dap_actions_st_local, sizeof(DapActions_t));
                  dap_action_update[pedalIdx] = true;
                }
              }
            #endif
            break;
          }

          //case action for ota
          case DAP_PAYLOAD_TYPE_ACTION_OTA_U8:
          {
            #ifndef USB_JOYSTICK
              ActiveSerial->println("[L]get OTA command and its info");
              memcpy(&dap_action_ota_st, packet_start, sizeof(DapActionOta_t));
              //ActiveSerial->readBytes((char *)&dap_action_ota_st, sizeof(DapActionOta_t));
              #ifdef OTA_Update
                bool structChecker_b = true;
                if (dap_action_ota_st.payloadHeader_st.payloadType_u8 != DAP_PAYLOAD_TYPE_ACTION_OTA_U8)
                {
                  structChecker_b = false;
                  structIsValid = false;
                }
                if (structChecker_b)
                {
                  SSID = new char[dap_action_ota_st.payloadOtaInfo_st.ssidLength_u8 + 1];
                  PASS = new char[dap_action_ota_st.payloadOtaInfo_st.passLength_u8 + 1];
                  memcpy(SSID, dap_action_ota_st.payloadOtaInfo_st.wifiSsid_au8, dap_action_ota_st.payloadOtaInfo_st.ssidLength_u8);
                  memcpy(PASS, dap_action_ota_st.payloadOtaInfo_st.wifiPass_au8, dap_action_ota_st.payloadOtaInfo_st.passLength_u8);
                  SSID[dap_action_ota_st.payloadOtaInfo_st.ssidLength_u8] = 0;
                  PASS[dap_action_ota_st.payloadOtaInfo_st.passLength_u8] = 0;
                  /*
                  ActiveSerial->printf("[L]Device ID:%d\n",dap_action_ota_st.payloadOtaInfo_st.deviceId_u8);
                  ActiveSerial->print("[L]SSID(uint)=");
                  for(uint i=0; i<dap_action_ota_st.payloadOtaInfo_st.ssidLength_u8;i++)
                  {
                    ActiveSerial->print(dap_action_ota_st.payloadOtaInfo_st.wifiSsid_au8[i]);
                    ActiveSerial->print(",");
                  }
                  ActiveSerial->println(" ");
                  ActiveSerial->print("[L]PASS(uint)=");
                  for(uint i=0; i<dap_action_ota_st.payloadOtaInfo_st.passLength_u8;i++)
                  {
                    ActiveSerial->print(dap_action_ota_st.payloadOtaInfo_st.wifiPass_au8[i]);
                    ActiveSerial->print(",");
                  }
                  ActiveSerial->println(" ");

                  ActiveSerial->print("[L]SSID=");
                  ActiveSerial->println(SSID);
                  ActiveSerial->print("[L]PASS=");
                  ActiveSerial->println(PASS);
                  */
                }

                if (dap_action_ota_st.payloadOtaInfo_st.deviceId_u8 == DEVICE_ID && structChecker_b == true)
                {
                  OTA_enable_b = true;
                  ActiveSerial->println("[L] Bridge OTA begin.");
                }
                else if (structChecker_b)
                {
                  g_pedalOtaAction_b = true;
                }
              #endif
            #endif
            break;
          }
          case DAP_PAYLOAD_TYPE_BRIDGE_STATE_U8:
          {
            #ifndef USB_JOYSTICK
              bool structChecker = true;
              DapBridgeState_t dap_bridge_state_local;
              //dap_bridge_state_local_ptr = &dap_bridge_state_lcl;
              memcpy(&dap_bridge_state_local, packet_start, sizeof(DapBridgeState_t));
              //ActiveSerial->readBytes((char *)dap_bridge_state_local_ptr, sizeof(DapBridgeState_t));
              // check if data is plausible
              if (dap_bridge_state_local.payloadHeader_st.payloadType_u8 != DAP_PAYLOAD_TYPE_BRIDGE_STATE_U8)
              {
                structChecker = false;
                structIsValid = false;
                ActiveSerial->print("[L]Payload type expected: ");
                ActiveSerial->print(DAP_PAYLOAD_TYPE_BRIDGE_STATE_U8);
                ActiveSerial->print(",   Payload type received: ");
                ActiveSerial->println(dap_bridge_state_local.payloadHeader_st.payloadType_u8);
              }
              if (dap_bridge_state_local.payloadHeader_st.version_u8 != DAP_VERSION_CONFIG_U8)
              {
                structChecker = false;
                structIsValid = false;
                ActiveSerial->print("[L]Config version expected: ");
                ActiveSerial->print(DAP_VERSION_CONFIG_U8);
                ActiveSerial->print(",   Config version received: ");
                ActiveSerial->println(dap_bridge_state_lcl.payloadHeader_st.version_u8);
              }
              // checksum validation
              uint16_t crc = checksumCalculator((uint8_t *)(&(dap_bridge_state_local.payloadHeader_st)), sizeof(dap_bridge_state_local.payloadHeader_st) + sizeof(dap_bridge_state_local.payloadBridgeState_st));
              if (crc != dap_bridge_state_local.payloadFooter_st.checkSum_u16)
              {
                structChecker = false;
                structIsValid = false;
                ActiveSerial->print("[L]CRC expected: ");
                ActiveSerial->print(crc);
                ActiveSerial->print(",   CRC received: ");
                ActiveSerial->println(dap_bridge_state_local.payloadFooter_st.checkSum_u16);
              }
              // if checks are successfull, overwrite global configuration struct
              if (structChecker == true)
              {
                memcpy(&dap_bridge_state_lcl, &dap_bridge_state_local, sizeof(DapBridgeState_t));
                if (dap_bridge_state_lcl.payloadBridgeState_st.bridgeAction_u8 == BRIDGE_ACTION_ENABLE_PAIRING)
                {
                  #ifdef ESPNow_Pairing_function
                    ActiveSerial->println("[L]Bridge Pairing...");
                    g_softwarePairingAction_b = true;
                  #endif
                  #ifndef ESPNow_Pairing_function
                    ActiveSerial->println("[L]Pairing command didn't supported");
                  #endif
                }
                // action=2, restart
                if (dap_bridge_state_lcl.payloadBridgeState_st.bridgeAction_u8 == BRIDGE_ACTION_RESTART)
                {
                  ActiveSerial->println("[L]Bridge Restart");
                  delay(1000);
                  ESP.restart();
                }
                if (dap_bridge_state_lcl.payloadBridgeState_st.bridgeAction_u8 == BRIDGE_ACTION_DOWNLOAD_MODE)
                {
                  // aciton=3 restart into boot mode
                  #ifdef CONFIG_IDF_TARGET_ESP32S3
                    ActiveSerial->println("[L]Bridge Restart into Download mode");
                    delay(1000);
                    REG_WRITE(RTC_CNTL_OPTION1_REG, RTC_CNTL_FORCE_DOWNLOAD_BOOT);
                    ESP.restart();
                  #else
                    ActiveSerial->println("[L]Command not supported ");
                    delay(1000);
                  #endif
                }
                if (dap_bridge_state_lcl.payloadBridgeState_st.bridgeAction_u8 == BRIDGE_ACTION_DEBUG)
                {
                  if (isBridgeInDebugMode_b)
                  {
                    // aciton=4 print pedal update interval
                    ActiveSerial->println("[L]Bridge debug mode off.");
                    isBridgeInDebugMode_b = false;
                  }
                  else
                  {
                    // aciton=4 print pedal update interval
                    ActiveSerial->println("[L]Bridge debug mode on.");
                    firstDebugMessage_b = true;
                    isBridgeInDebugMode_b = true;
                  }
                }
                if (dap_bridge_state_lcl.payloadBridgeState_st.bridgeAction_u8 == BRIDGE_ACTION_JOYSTICK_FLASHING_MODE)
                {
                  #ifdef External_RP2040
                    ActiveSerial->println("[L]JOYSTICK restart into flashing mode");
                    dap_joystickUART_state_lcl._payloadjoystick.JoystickAction = JOYSTICKACTION_RESET_INTO_BOOTLOADER;
                  #else
                    ActiveSerial->println("[L]The command is not supported");
                  #endif
                }
                if (dap_bridge_state_lcl.payloadBridgeState_st.bridgeAction_u8 == BRIDGE_ACTION_JOYSTICK_DEBUG)
                {
                  #ifdef External_RP2040
                    ActiveSerial->println("[L]JOYSTICK debug mode on");
                    dap_joystickUART_state_lcl._payloadjoystick.JoystickAction = JOYSTICKACTION_DEBUG_MODE;
                  #else
                    ActiveSerial->println("[L]The command is not supported");
                  #endif
                }
                if (dap_bridge_state_lcl.payloadBridgeState_st.bridgeAction_u8 == BRIDGE_ACTION_SET_PEDAL_WIRELESS_SYNC)
                {
                  g_pedalWirelessSyncEnabled_ab[0] = (dap_bridge_state_lcl.payloadBridgeState_st.pedalAvailability_au8[0] != 0);
                  g_pedalWirelessSyncEnabled_ab[1] = (dap_bridge_state_lcl.payloadBridgeState_st.pedalAvailability_au8[1] != 0);
                  g_pedalWirelessSyncEnabled_ab[2] = (dap_bridge_state_lcl.payloadBridgeState_st.pedalAvailability_au8[2] != 0);
                  for (int pIdx = 0; pIdx < 3; pIdx++)
                  {
                    if (!g_pedalWirelessSyncEnabled_ab[pIdx])
                    {
                      g_joystickValueOriginal_au16[pIdx] = JOYSTICK_MIN_VALUE;
                      g_joystickValue_au16[pIdx] = JOYSTICK_MIN_VALUE;
                      dap_bridge_state_st.payloadBridgeState_st.pedalAvailability_au8[pIdx] = 0;
                      dap_bridge_state_st.payloadBridgeState_st.pedalRssiRealtime_ai32[pIdx] = 0;
                      g_rssi_ai32[pIdx] = 0;
                      if (pIdx == 0) g_pedalClutchValue_u16 = JOYSTICK_MIN_VALUE;
                      if (pIdx == 1) g_pedalBrakeValue_u16 = JOYSTICK_MIN_VALUE;
                      if (pIdx == 2) g_pedalThrottleValue_u16 = JOYSTICK_MIN_VALUE;
                    }
                  }
                }
              }
            #endif
            break;
          }
          case DAP_PAYLOAD_TYPE_WIFI_CHANNEL_U8:
          {
            bool structChecker = true;
            DapWifiChannel_t wifiChannel_local;
            memcpy(&wifiChannel_local, packet_start, sizeof(DapWifiChannel_t));
            if (wifiChannel_local.payloadHeader_st.payloadType_u8 != DAP_PAYLOAD_TYPE_WIFI_CHANNEL_U8)
            {
              structChecker = false;
              structIsValid = false;
            }
            if (wifiChannel_local.payloadHeader_st.version_u8 != DAP_VERSION_CONFIG_U8)
            {
              structChecker = false;
              structIsValid = false;
            }
            uint16_t crc = checksumCalculator((uint8_t *)(&(wifiChannel_local.payloadHeader_st)), sizeof(wifiChannel_local.payloadHeader_st) + sizeof(wifiChannel_local.payloadWifiChannel_st));
            if (crc != wifiChannel_local.payloadFooter_st.checkSum_u16)
            {
              structChecker = false;
              structIsValid = false;
            }
            if (structChecker == true)
            {
              uint8_t cmd = wifiChannel_local.payloadWifiChannel_st.command_u8;
              if (cmd == WIFI_CH_CMD_SCAN_REQ)
              {
                handleWifiScanRequest(false);
              }
              else if (cmd == WIFI_CH_CMD_SET_REQ)
              {
                uint8_t targetCh = wifiChannel_local.payloadWifiChannel_st.currentChannel_u8;
                if (targetCh < 1 || targetCh > 14) {
                  targetCh = wifiChannel_local.payloadWifiChannel_st.recommendedChannel_u8;
                }
                handleWifiSetChannelRequest(targetCh, false);
              }
              else
              {
                sendWifiChannelStatus(false);
              }
            }
            break;
          }
          //case action for servo config
          case DAP_PAYLOAD_TYPE_SERVO_CONFIG_U8:
          {
            #ifndef USB_JOYSTICK
              bool structChecker = true;
              DAP_servo_config_st_t dap_servo_config_local;
              memcpy(&dap_servo_config_local, packet_start, sizeof(DAP_servo_config_st_t));
              
