orosys/DIY-Sim-Racing-FFB-Pedal/ESP32_master/src/Main.cpp
              if (dap_servo_config_local.payloadHeader_st.payloadType_u8 != DAP_PAYLOAD_TYPE_SERVO_CONFIG_U8)
              {
                structChecker = false;
                structIsValid = false;
              }
              if (dap_servo_config_local.payloadHeader_st.version_u8 != DAP_VERSION_CONFIG_U8)
              {
                structChecker = false;
                structIsValid = false;
              }
              uint16_t crc = checksumCalculator((uint8_t *)(&(dap_servo_config_local.payloadHeader_st)), sizeof(dap_servo_config_local.payloadHeader_st) + sizeof(dap_servo_config_local.payloadServoConfig_st));
              if (crc != dap_servo_config_local.payloadFooter_st.checkSum_u16)
              {
                structChecker = false;
                structIsValid = false;
              }
              if (structChecker == true)
              {
                int pedalIdx = dap_servo_config_local.payloadHeader_st.pedalTag_u8;
                if(pedalIdx >= 0 && pedalIdx < 3)
                {
                  memcpy(&dap_servo_config_st[pedalIdx], &dap_servo_config_local, sizeof(DAP_servo_config_st_t));
                  update_servo_config[pedalIdx] = true;
                }
              }
            #endif
            break;
          }
          default:
          {
            ActiveSerial->println("[L]Unknown payload type");
            break;
          }
        }//switch end
        if (!structIsValid)
        {
          ActiveSerial->printf("[L]Invalid packet detected (Type: %d). Skipping SOF.\n", payloadType);
          ActiveSerial->println("");
          buffer_idx++; // Skip the failed SOF and continue scanning
        }
        else
        {
          // Packet was valid and processed, advance index past this packet
          buffer_idx += expectedSize;
        }
      }//while end
      // --- 3. Clean up the buffer ---
      if (buffer_idx > 0)
      {
        size_t remaining_len = buffer_len - buffer_idx;
        if (remaining_len > 0)
        {
          memmove(rx_buffer, &rx_buffer[buffer_idx], remaining_len);
        }
        buffer_len = remaining_len;
      }
    }
  }
}


void serialCommunicationTxTask( void * pvParameters)
{
  for(;;)
  { 
    if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0) 
    {
      //ActiveSerial->println("tx kick");
      uint16_t crc;
      unsigned long current_time=millis();
      #ifndef USB_JOYSTICK
        if(current_time-bridge_state_last_update>200)
        {
          basic_rssi_update=true;
          bridge_state_last_update=millis();
        }
      
        if(current_time-PedalUpdateLast>500)
        {
          PedalUpdateIntervalPrint_b=true;
          PedalUpdateLast=current_time;
        }
      #endif
      if(current_time-UARTJoystickUpdateLast>7)
      {
        UARTJoystickUpdate_b=true;
        UARTJoystickUpdateLast=current_time;
      }
      bool structChecker = true;
      #ifndef USB_JOYSTICK
        for(int i =0; i<3; i++)
        {
          if(g_updateBasicState_ab[i])
          {
            g_updateBasicState_ab[i]=false;
            ActiveSerial->write((char*)&dap_state_basic_st[i], sizeof(DapStateBasic_t));
            ActiveSerial->print("\r\n");
            if(dap_bridge_state_st.payloadBridgeState_st.pedalAvailability_au8[dap_state_basic_st[i].payloadHeader_st.pedalTag_u8]==0)
            {
              ActiveSerial->print("[L]Found Pedal:");
              ActiveSerial->println(dap_state_basic_st[i].payloadHeader_st.pedalTag_u8);
            }
            dap_bridge_state_st.payloadBridgeState_st.pedalAvailability_au8[dap_state_basic_st[i].payloadHeader_st.pedalTag_u8]=1;
            //g_pedalLastUpdate_au32[dap_state_basic_st[i].payloadHeader_st.pedalTag_u8]=millis();
            if(g_espNowError_ab[i])
            {
              ActiveSerial->print("[L]Pedal:");
              ActiveSerial->print(dap_state_basic_st[i].payloadHeader_st.pedalTag_u8);
              ActiveSerial->print(" E:");
              ActiveSerial->println(dap_state_basic_st[i].payloadPedalStateBasic_st.errorCode_u8);
              g_espNowError_ab[i]=false;    
            }
          }
          if(g_updateExtendState_ab[i])
          {
            g_updateExtendState_ab[i]=false;
            ActiveSerial->write((char*)&dap_state_extended_st[i], sizeof(DapStateExtended_t));
            ActiveSerial->print("\r\n");

          }
          
          // Forward Servo Config Responses to Host ---
          if(send_servo_config_to_host[i])
          {
            send_servo_config_to_host[i] = false;
            ActiveSerial->write((char*)&dap_servo_config_response_st[i], sizeof(DAP_servo_config_st_t));
            ActiveSerial->print("\r\n");
          }

        }
      
        int pedal_config_IDX=0;
        for(pedal_config_IDX=0;pedal_config_IDX<3;pedal_config_IDX++)
        {
          if(g_espNowRequestConfig_ab[pedal_config_IDX])
          {
            DapConfig_t * dap_config_st_local_ptr;
            DapConfig_t dap_config_st_local;
            if(pedal_config_IDX==0)
            {
              memcpy(&dap_config_st_local, &dap_config_st_Clu, sizeof(DapConfig_t));
              //dap_config_st_local_ptr = &dap_config_st_Clu;
            }
            if(pedal_config_IDX==1)
            {
              memcpy(&dap_config_st_local, &dap_config_st_Brk, sizeof(DapConfig_t));
              //dap_config_st_local_ptr = &dap_config_st_Brk;
            }
            if(pedal_config_IDX==2)
            {
              memcpy(&dap_config_st_local, &dap_config_st_Gas, sizeof(DapConfig_t));
              //dap_config_st_local_ptr = &dap_config_st_Gas;
            }
            dap_config_st_local_ptr= &dap_config_st_local;
            
            //uint16_t crc = checksumCalculator((uint8_t*)(&(dap_config_st.payloadHeader_st)), sizeof(dap_config_st.payloadHeader_st) + sizeof(dap_config_st.payloadPedalConfig_st));

            dap_config_st_local_ptr->payloadHeader_st.pedalTag_u8=dap_config_st_local_ptr->payloadPedalConfig_st.pedalType_u8;
            crc = checksumCalculator((uint8_t*)(&(dap_config_st_local.payloadHeader_st)), sizeof(dap_config_st_local.payloadHeader_st) + sizeof(dap_config_st_local.payloadPedalConfig_st));
            dap_config_st_local_ptr->payloadFooter_st.checkSum_u16 = crc;
            ActiveSerial->write((char*)dap_config_st_local_ptr, sizeof(DapConfig_t));
            ActiveSerial->print("\r\n");
            g_espNowRequestConfig_ab[pedal_config_IDX]=false;
            ActiveSerial->print("[L]Pedal:");
            ActiveSerial->print(pedal_config_IDX);
            ActiveSerial->println(" config returned");
            delay(3);
          }
        }
      

        if(basic_rssi_update)//Bridge action
        {
          //fill header and footer
          dap_bridge_state_st.payloadHeader_st.startOfFrame0_u8 = SOF_BYTE_0_U8;
          dap_bridge_state_st.payloadHeader_st.startOfFrame1_u8 = SOF_BYTE_1_U8;
          dap_bridge_state_st.payloadFooter_st.enfOfFrame0_u8 = EOF_BYTE_0_U8;
          dap_bridge_state_st.payloadFooter_st.enfOfFrame1_u8 = EOF_BYTE_1_U8;
          int rssi_filter_value=constrain(rssi_filter.process(g_rssiDisplay_i32),-100,0) ;
          dap_bridge_state_st.payloadHeader_st.pedalTag_u8=5; //5 means bridge
          dap_bridge_state_st.payloadHeader_st.payloadType_u8=DAP_PAYLOAD_TYPE_BRIDGE_STATE_U8;
          dap_bridge_state_st.payloadHeader_st.version_u8=DAP_VERSION_CONFIG_U8;
          dap_bridge_state_st.payloadBridgeState_st.bridgeAction_u8=0;
          memcpy(dap_bridge_state_st.payloadBridgeState_st.pedalRssiRealtime_ai32,g_rssi_ai32,sizeof(int32_t)*3);
          //parse_version(BRIDGE_FIRMWARE_VERSION,&dap_bridge_state_st.payloadBridgeState_st.Bridge_firmware_version_u8[0],&dap_bridge_state_st.payloadBridgeState_st.Bridge_firmware_version_u8[1],&dap_bridge_state_st.payloadBridgeState_st.Bridge_firmware_version_u8[2]);
          dap_bridge_state_st.payloadBridgeState_st.bridgeFirmwareVersion_au8[0]=versionMajor;
          dap_bridge_state_st.payloadBridgeState_st.bridgeFirmwareVersion_au8[1]=versionMinor;
          dap_bridge_state_st.payloadBridgeState_st.bridgeFirmwareVersion_au8[2]=versionPatch;
          uint8_t unassignedCount = 0;
          memset(dap_bridge_state_st.payloadBridgeState_st.macAddressDetected_au8, 0, sizeof(dap_bridge_state_st.payloadBridgeState_st.macAddressDetected_au8));
          for (int p = 5; p < 8; p++) {
            bool hasMac = false;
            for (int b = 0; b < 6; b++) {
              if (g_pedalMac_aau8[p][b] != 0) {
                hasMac = true;
                break;
              }
            }
            if (hasMac) {
              unassignedCount++;
              int offset = (p - 5) * 6;
              if (offset + 6 <= sizeof(dap_bridge_state_st.payloadBridgeState_st.macAddressDetected_au8)) {
                memcpy(&dap_bridge_state_st.payloadBridgeState_st.macAddressDetected_au8[offset], g_pedalMac_aau8[p], 6);
              }
            }
          }
          dap_bridge_state_st.payloadBridgeState_st.unassignedPedalCount_u8 = unassignedCount;
          //CRC check should be in the final
          crc = checksumCalculator((uint8_t*)(&(dap_bridge_state_st.payloadHeader_st)), sizeof(dap_bridge_state_st.payloadHeader_st) + sizeof(dap_bridge_state_st.payloadBridgeState_st));
          dap_bridge_state_st.payloadFooter_st.checkSum_u16=crc;
          DapBridgeState_t * dap_bridge_st_local_ptr;
          dap_bridge_st_local_ptr = &dap_bridge_state_st;
          ActiveSerial->write((char*)dap_bridge_st_local_ptr, sizeof(DapBridgeState_t));
          ActiveSerial->print("\r\n");
          basic_rssi_update=false;
          /*
          if(rssi_filter_value<-88)
          {
            ActiveSerial->println("Warning: BAD WIRELESS CONNECTION");
            //ActiveSerial->print("Pedal:");
            //ActiveSerial->print(dap_state_basic_st.payloadHeader_st.pedalTag_u8);
            ActiveSerial->print(" RSSI:");
            ActiveSerial->println(rssi_filter_value);  
          }
          */
          #ifdef ESPNow_debug
              ActiveSerial->print("Pedal:");
              ActiveSerial->print(dap_state_basic_st.payloadHeader_st.pedalTag_u8);
              ActiveSerial->print(" RSSI:");
              ActiveSerial->println(rssi_filter_value);
          #endif
        }
      #endif
        #ifdef External_RP2040
        if(UARTJoystickUpdate_b)
        {
          DAP_JoystickUART_State * dap_joystickUART_state_local_ptr;
          UARTJoystickUpdate_b=false;
          dap_joystickUART_state_lcl._payloadjoystick.payloadtype=(uint8_t)DAP_PAYLOAD_TYPE_JOYSTICKUART;
          dap_joystickUART_state_lcl._payloadjoystick.key = DAP_JOY_KEY;
          dap_joystickUART_state_lcl._payloadjoystick.DAP_JOY_Version = DAP_JOY_VERSION;
          for(int i=0; i<3;i++)
          {
            dap_joystickUART_state_lcl._payloadjoystick.controllerValue_i32[i] = g_pedalWirelessSyncEnabled_ab[i] ? g_joystickValueOriginal_au16[i] : JOYSTICK_MIN_VALUE;
            dap_joystickUART_state_lcl._payloadjoystick.pedalAvailability[i] = g_pedalWirelessSyncEnabled_ab[i] ? dap_bridge_state_st.payloadBridgeState_st.pedalAvailability_au8[i] : 0;
          }
          dap_joystickUART_state_lcl._payloadjoystick.pedal_status=g_pedalStatus_u8;
          dap_joystickUART_state_lcl._payloadfooter.checkSum_u16= checksumCalculator((uint8_t*)(&(dap_joystickUART_state_lcl._payloadjoystick)), sizeof(dap_joystickUART_state_lcl._payloadjoystick));
          _rp2040picoUART->UARTSendPacket((uint8_t*)&dap_joystickUART_state_lcl, sizeof(DAP_JoystickUART_State));
          if(dap_joystickUART_state_lcl._payloadjoystick.JoystickAction!=0)
          {
            dap_joystickUART_state_lcl._payloadjoystick.JoystickAction=0;
          }

