orosys/DIY-Sim-Racing-FFB-Pedal/ESP32_master/src/Main.cpp
void hidCommunicaitonTxTask(void *pvParameters)
{
  for(;;)
  {
    if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0) 
    {
      #ifdef USB_JOYSTICK
        uint16_t crc;
        unsigned long current_time=millis();
        
        if(current_time-bridge_state_last_update>200)
        {
          basic_rssi_update=true;
          bridge_state_last_update=millis();
        }
        
        if(current_time-PedalUpdateLast>500)
        {
          PedalUpdateIntervalPrint_b=true;
          PedalUpdateLast=current_time;
        }
        /*
        if(current_time-UARTJoystickUpdateLast>7)
        {
          UARTJoystickUpdate_b=true;
          UARTJoystickUpdateLast=current_time;
        }
        */
        bool structChecker = true;
        
        for(int i =0; i<3; i++)
        {
          if(g_updateBasicState_ab[i])
          {
            g_updateBasicState_ab[i]=false;

            if(isBridgeInDebugMode_b) {
              tinyusbJoystick_.printf("BasicState gesendet - Tag: %d", dap_state_basic_st[i].payloadHeader_st.pedalTag_u8);
            }
            
            tinyusbJoystick_.sendData((uint8_t*)&dap_state_basic_st[i], sizeof(DapStateBasic_t));
            if(dap_bridge_state_st.payloadBridgeState_st.pedalAvailability_au8[dap_state_basic_st[i].payloadHeader_st.pedalTag_u8]==0)
            {
              ActiveSerial->print("[L]Found Pedal:");
              ActiveSerial->println(dap_state_basic_st[i].payloadHeader_st.pedalTag_u8);
              tinyusbJoystick_.printf("Found Pedal: %d",dap_state_basic_st[i].payloadHeader_st.pedalTag_u8);
            }
            dap_bridge_state_st.payloadBridgeState_st.pedalAvailability_au8[dap_state_basic_st[i].payloadHeader_st.pedalTag_u8]=1;
            //g_pedalLastUpdate_au32[dap_state_basic_st[i].payloadHeader_st.pedalTag_u8]=millis();
            if(g_espNowError_ab[i])
            {
              ActiveSerial->print("[L]Pedal:");
              ActiveSerial->print(dap_state_basic_st[i].payloadHeader_st.pedalTag_u8);
              ActiveSerial->print(" E:");
              ActiveSerial->println(dap_state_basic_st[i].payloadPedalStateBasic_st.errorCode_u8);
              tinyusbJoystick_.printf("Pedal: %d E: %d",dap_state_basic_st[i].payloadHeader_st.pedalTag_u8,dap_state_basic_st[i].payloadPedalStateBasic_st.errorCode_u8);
              g_espNowError_ab[i]=false;    
            }
          }
          if(g_updateExtendState_ab[i])
          {
            g_updateExtendState_ab[i]=false;
            tinyusbJoystick_.sendData((uint8_t*)&dap_state_extended_st[i], sizeof(DapStateExtended_t));
            

          }

          // Forward Servo Config Responses to Host via HID ---
          if(send_servo_config_to_host[i])
          {
            send_servo_config_to_host[i] = false;
            tinyusbJoystick_.sendData((uint8_t*)&dap_servo_config_response_st[i], sizeof(DAP_servo_config_st_t));
          }
        }
        

        int pedal_config_IDX=0;
        for(pedal_config_IDX=0;pedal_config_IDX<3;pedal_config_IDX++)
        {
          if(g_espNowRequestConfig_ab[pedal_config_IDX])
          {
            DapConfig_t * dap_config_st_local_ptr;
            DapConfig_t dap_config_st_local;
            if(pedal_config_IDX==0)
            {
              memcpy(&dap_config_st_local, &dap_config_st_Clu, sizeof(DapConfig_t));
              //dap_config_st_local_ptr = &dap_config_st_Clu;
            }
            if(pedal_config_IDX==1)
            {
              memcpy(&dap_config_st_local, &dap_config_st_Brk, sizeof(DapConfig_t));
              //dap_config_st_local_ptr = &dap_config_st_Brk;
            }
            if(pedal_config_IDX==2)
            {
              memcpy(&dap_config_st_local, &dap_config_st_Gas, sizeof(DapConfig_t));
              //dap_config_st_local_ptr = &dap_config_st_Gas;
            }
            dap_config_st_local_ptr= &dap_config_st_local;
            
            //uint16_t crc = checksumCalculator((uint8_t*)(&(dap_config_st.payloadHeader_st)), sizeof(dap_config_st.payloadHeader_st) + sizeof(dap_config_st.payloadPedalConfig_st));

            dap_config_st_local_ptr->payloadHeader_st.pedalTag_u8=dap_config_st_local_ptr->payloadPedalConfig_st.pedalType_u8;
            crc = checksumCalculator((uint8_t*)(&(dap_config_st_local.payloadHeader_st)), sizeof(dap_config_st_local.payloadHeader_st) + sizeof(dap_config_st_local.payloadPedalConfig_st));
            dap_config_st_local_ptr->payloadFooter_st.checkSum_u16 = crc;
            tinyusbJoystick_.sendData((uint8_t*)&dap_config_st_local.payloadHeader_st, sizeof(DapConfig_t));
            g_espNowRequestConfig_ab[pedal_config_IDX]=false;
            ActiveSerial->print("[L]Pedal:");
            ActiveSerial->print(pedal_config_IDX);
            ActiveSerial->println(" config returned");
            delay(3);
          }
        }

        
        if(basic_rssi_update)//Bridge action
        {
          //fill header and footer
          dap_bridge_state_st.payloadHeader_st.startOfFrame0_u8 = SOF_BYTE_0_U8;
          dap_bridge_state_st.payloadHeader_st.startOfFrame1_u8 = SOF_BYTE_1_U8;
          dap_bridge_state_st.payloadFooter_st.enfOfFrame0_u8 = EOF_BYTE_0_U8;
          dap_bridge_state_st.payloadFooter_st.enfOfFrame1_u8 = EOF_BYTE_1_U8;
          int rssi_filter_value=constrain(rssi_filter.process(g_rssiDisplay_i32),-100,0) ;
          dap_bridge_state_st.payloadHeader_st.pedalTag_u8=5; //5 means bridge
          dap_bridge_state_st.payloadHeader_st.payloadType_u8=DAP_PAYLOAD_TYPE_BRIDGE_STATE_U8;
          dap_bridge_state_st.payloadHeader_st.version_u8=DAP_VERSION_CONFIG_U8;
          dap_bridge_state_st.payloadBridgeState_st.bridgeAction_u8=0;
          memcpy(dap_bridge_state_st.payloadBridgeState_st.pedalRssiRealtime_ai32,g_rssi_ai32,sizeof(int32_t)*3);
          //parse_version(BRIDGE_FIRMWARE_VERSION,&dap_bridge_state_st.payloadBridgeState_st.Bridge_firmware_version_u8[0],&dap_bridge_state_st.payloadBridgeState_st.Bridge_firmware_version_u8[1],&dap_bridge_state_st.payloadBridgeState_st.Bridge_firmware_version_u8[2]);
          dap_bridge_state_st.payloadBridgeState_st.bridgeFirmwareVersion_au8[0]=versionMajor;
          dap_bridge_state_st.payloadBridgeState_st.bridgeFirmwareVersion_au8[1]=versionMinor;
          dap_bridge_state_st.payloadBridgeState_st.bridgeFirmwareVersion_au8[2]=versionPatch;
          uint8_t unassignedCount = 0;
          memset(dap_bridge_state_st.payloadBridgeState_st.macAddressDetected_au8, 0, sizeof(dap_bridge_state_st.payloadBridgeState_st.macAddressDetected_au8));
          for (int p = 5; p < 8; p++) {
            bool hasMac = false;
            for (int b = 0; b < 6; b++) {
              if (g_pedalMac_aau8[p][b] != 0) {
                hasMac = true;
                break;
              }
            }
            if (hasMac) {
              unassignedCount++;
              int offset = (p - 5) * 6;
              if (offset + 6 <= sizeof(dap_bridge_state_st.payloadBridgeState_st.macAddressDetected_au8)) {
                memcpy(&dap_bridge_state_st.payloadBridgeState_st.macAddressDetected_au8[offset], g_pedalMac_aau8[p], 6);
              }
            }
          }
          dap_bridge_state_st.payloadBridgeState_st.unassignedPedalCount_u8 = unassignedCount;
          //CRC check should be in the final
          crc = checksumCalculator((uint8_t*)(&(dap_bridge_state_st.payloadHeader_st)), sizeof(dap_bridge_state_st.payloadHeader_st) + sizeof(dap_bridge_state_st.payloadBridgeState_st));
          dap_bridge_state_st.payloadFooter_st.checkSum_u16=crc;
          DapBridgeState_t * dap_bridge_st_local_ptr;
          dap_bridge_st_local_ptr = &dap_bridge_state_st;
          tinyusbJoystick_.sendData((uint8_t*)&dap_bridge_state_st, sizeof(DapBridgeState_t));
          basic_rssi_update=false;
        }
        PayloadHidMessage_t receivedMsg;
        if (xQueueReceive(g_messageQueueHandle_pv, &receivedMsg, (TickType_t)0) == pdTRUE)
        {
          tinyusbJoystick_.sendData((uint8_t*)&receivedMsg, sizeof(PayloadHidMessage_t));
          delay(1);
        }
        //
        if(PedalUpdateIntervalPrint_b)
        {
          if(isBridgeInDebugMode_b)
          {
            if(firstDebugMessage_b)
            {
              firstDebugMessage_b = false;
              tinyusbJoystick_.printf("Bridge Board:%s, Version:%s.", BRIDGE_BOARD, BRIDGE_FIRMWARE_VERSION); 
              tinyusbJoystick_.printf("Bridge Original Mac: %02X:%02X:%02X:%02X:%02X:%02X", g_espMac_au8[0], g_espMac_au8[1], g_espMac_au8[2], g_espMac_au8[3], g_espMac_au8[4], g_espMac_au8[5]);
              uint8_t espMac_au8[] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
              WiFi.macAddress(espMac_au8);  
              tinyusbJoystick_.printf("Bridge Mac OverWritted: %02X:%02X:%02X:%02X:%02X:%02X", espMac_au8[0], espMac_au8[1], espMac_au8[2], espMac_au8[3], espMac_au8[4], espMac_au8[5]);
              
            }
            for(int pedalIDX=0;pedalIDX<3;pedalIDX++)
            {
              if(dap_bridge_state_st.payloadBridgeState_st.pedalAvailability_au8[pedalIDX]==1)
              {
                tinyusbJoystick_.printf("Pedal %d, Update Interval: %d, RSSI: %d", pedalIDX, (int)(millis()-g_pedalLastUpdate_au32[pedalIDX]),g_rssi_ai32[pedalIDX]);
                //delay(10);
              }
            }
          }
          PedalUpdateIntervalPrint_b=false;
        }

      #endif
    }
  }
}
